docs: show RFCs on the docs site
